7-29.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2016-07-29 Fri 15:46 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="章立">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> This week</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 学习docker</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="http://192.168.199.107:10080/w/docker_usage_and_study/">骆裕龙文档</a>
</li>
<li><a href="http://docs.daocloud.io/faq/docker101">DaoCloud文档</a>
</li>
<li><a href="https://docs.docker.com/">docker官方文档</a>
</li>
<li><a href="https://www.youtube.com/playlist?list=PLkA60AVN3hh_6cAz8TUGtkYbJSL2bdZ4h">youtube视频教程</a>
</li>
<li><a href="https://www.youtube.com/user/dockerrun">dockercon</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 学习tmux</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>适合长时间ssh操作
</li>
<li>可以保存和重建所有的会话状态
</li>
<li>网络坏境不稳定时，不会中断当前的操作
</li>
<li><a href="https://www.youtube.com/playlist?list=PLtK75qxsQaMJ_DmXk9yZbCBJuG9HRwlGc">tmux视频教程</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 搭建deep learning框架</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>All-in-one Docker image for Deep Learning
<ul class="org-ul">
<li>Ubuntu 14.04
</li>
<li>CUDA 7.5 (GPU version only)
</li>
<li>cuDNN v4 (GPU version only)
</li>
<li>Tensorflow
</li>
<li>Caffe
</li>
<li>Theano
</li>
<li>Keras
</li>
<li>Lasagne
</li>
<li>Torch (includes nn, cutorch, cunn and cuDNN bindings)
</li>
<li>iPython/Jupyter Notebook (including iTorch kernel)
</li>
<li>Numpy, SciPy, Pandas, Scikit Learn, Matplotlib
</li>
<li>A few common libraries used for deep learning
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 安装dl-docker</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>安装docker
</li>
<li>安装nvidia驱动
</li>
<li>安装nvidia-docker
</li>
<li>安装dl-docker
</li>
</ol>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #586e75;"># </span><span style="color: #586e75;">Find your graphics card model</span>
lspci | grep -i nvidia

<span style="color: #586e75;"># </span><span style="color: #586e75;">Don't install two different drivers</span>
sudo apt-get purge bumblebee

<span style="color: #586e75;"># </span><span style="color: #586e75;">We will install the drivers using apt-get.</span>
sudo add-apt-repository ppa:graphics-drivers/ppa
sudo apt-get update
sudo apt-cache search nvidia
sudo apt-get install nvidia-367

<span style="color: #586e75;"># </span><span style="color: #586e75;">Don't need to install CUDA</span>


<span style="color: #586e75;"># </span><span style="color: #586e75;">Install nvidia-docker and nvidia-docker-plugin</span>
wget -P /tmp https://github.com/NVIDIA/nvidia-docker/releases/download/v1.0.0-rc.3/nvidia-docker_1.0.0.rc.3-1_amd64.deb
sudo dpkg -i /tmp/nvidia-docker*.deb &amp;&amp; rm /tmp/nvidia-docker*.deb

<span style="color: #586e75;"># </span><span style="color: #586e75;">Test nvidia-smi</span>
nvidia-docker run --rm nvidia/cuda nvidia-smi

<span style="color: #586e75;"># </span><span style="color: #586e75;">Install dl-docker</span>
docker pull floydhub/dl-docker:cpu

<span style="color: #586e75;"># </span><span style="color: #586e75;">CPU Version</span>
docker build -t floydhub/dl-docker:cpu -f Dockerfile.cpu .

<span style="color: #586e75;"># </span><span style="color: #586e75;">GPU Version</span>
docker build -t floydhub/dl-docker:gpu -f Dockerfile.gpu .
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 使用和调试deep learning框架caffe</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>学习中
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 筛选简历</h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Next week</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 学习使用caffe</h3>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. This week</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. 学习docker</a></li>
<li><a href="#sec-1-2">1.2. 学习tmux</a></li>
<li><a href="#sec-1-3">1.3. 搭建deep learning框架</a></li>
<li><a href="#sec-1-4">1.4. 安装dl-docker</a></li>
<li><a href="#sec-1-5">1.5. 使用和调试deep learning框架caffe</a></li>
<li><a href="#sec-1-6">1.6. 筛选简历</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Next week</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. 学习使用caffe</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: 章立</p>
<p class="date">Created: 2016-07-29 Fri 15:46</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org-mode</a> 8.3.4)</p>
</div>
</footer>
</body>
</html>
